addons/l10n_sg_ubl_pint/tests/expected_xmls/invoice.xml

<?xml version='1.0' encoding='UTF-8'?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
  <cbc:CustomizationID>urn:peppol:pint:billing-1@sg-1</cbc:CustomizationID>
  <cbc:ProfileID>urn:peppol:bis:billing</cbc:ProfileID>
  <cbc:ID>INV/2019/00001</cbc:ID>
  <cbc:UUID>___ignore___</cbc:UUID>
  <cbc:IssueDate>2019-01-01</cbc:IssueDate>
  <cbc:DueDate>2019-01-01</cbc:DueDate>
  <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
  <cbc:DocumentCurrencyCode>EUR</cbc:DocumentCurrencyCode>
  <cbc:TaxCurrencyCode>SGD</cbc:TaxCurrencyCode>
  <cac:OrderReference>
    <cbc:ID>INV/2019/00001</cbc:ID>
  </cac:OrderReference>
  <cac:AdditionalDocumentReference>
    <cbc:ID>SGD</cbc:ID>
    <cbc:DocumentTypeCode>sgdtotal-excl-gst</cbc:DocumentTypeCode>
    <cbc:DocumentDescription>1000.0</cbc:DocumentDescription>
  </cac:AdditionalDocumentReference>
  <cac:AdditionalDocumentReference>
    <cbc:ID>SGD</cbc:ID>
    <cbc:DocumentTypeCode>sgdtotal-incl-gst</cbc:DocumentTypeCode>
    <cbc:DocumentDescription>1090.0</cbc:DocumentDescription>
  </cac:AdditionalDocumentReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cbc:EndpointID schemeID="0195">201131415A</cbc:EndpointID>
      <cac:PartyName>
        <cbc:Name>company_1_data</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>Tyersall Avenue</cbc:StreetName>
        <cbc:CityName>Central Singapore</cbc:CityName>
        <cbc:PostalZone>248048</cbc:PostalZone>
        <cac:Country>
          <cbc:IdentificationCode>SG</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>197401143C</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
        <cbc:CompanyID>197401143C</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>company_1_data</cbc:Name>
        <cbc:Telephone>+65 9123 4567</cbc:Telephone>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cac:PartyName>
        <cbc:Name>partner_a</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>that other street, 3</cbc:StreetName>
        <cbc:CityName>East Singapore</cbc:CityName>
        <cbc:PostalZone>248050</cbc:PostalZone>
        <cac:Country>
          <cbc:IdentificationCode>SG</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>S16FC0121D</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>partner_a</cbc:RegistrationName>
        <cbc:CompanyID>S16FC0121D</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>partner_a</cbc:Name>
        <cbc:Telephone>+65 9123 4589</cbc:Telephone>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:Delivery>
    <cac:DeliveryLocation>
      <cac:Address>
        <cbc:StreetName>that other street, 3</cbc:StreetName>
        <cbc:CityName>East Singapore</cbc:CityName>
        <cbc:PostalZone>248050</cbc:PostalZone>
        <cac:Country>
          <cbc:IdentificationCode>SG</cbc:IdentificationCode>
        </cac:Country>
      </cac:Address>
    </cac:DeliveryLocation>
  </cac:Delivery>
  <cac:PaymentMeans>
    <cbc:PaymentMeansCode name="mutually defined">ZZZ</cbc:PaymentMeansCode>
    <cbc:PaymentID>INV/2019/00001</cbc:PaymentID>
  </cac:PaymentMeans>
  <cac:PaymentTerms>
    <cbc:Note>Payment terms: Immediate Payment</cbc:Note>
  </cac:PaymentTerms>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="EUR">180.00</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="EUR">2000.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="EUR">180.00</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:ID>SR</cbc:ID>
        <cbc:Percent>9.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="SGD">90.00</cbc:TaxAmount>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="EUR">2000.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="EUR">2000.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="EUR">2180.00</cbc:TaxInclusiveAmount>
    <cbc:PrepaidAmount currencyID="EUR">0.00</cbc:PrepaidAmount>
    <cbc:PayableAmount currencyID="EUR">2180.00</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="C62">1.0</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="EUR">2000.00</cbc:LineExtensionAmount>
    <cac:Item>
      <cbc:Description>product_a</cbc:Description>
      <cbc:Name>product_a</cbc:Name>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>SR</cbc:ID>
        <cbc:Percent>9.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="EUR">2000.0</cbc:PriceAmount>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>
